Revit 2027 API
SaveAsOptions Methods
The SaveAsOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetWorksharingOptions |  Gets Worksharing options for SaveAs.
SetWorksharingOptions |  Sets Worksharing options for SaveAs.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
SaveAsOptions Class
Autodesk.Revit.DB Namespace